{
  "Manage Conflict": {
    "learn": {
      "definition": "Conflict is professional friction over competing project priorities (Time, Budget, Quality), not personal 'fighting'.",
      "context": "Disagreements peak during the 'Storming' stage. PMs must facilitate the transition to 'Norming' to maintain velocity.",
      "path": "Prioritize Collaboration (Win-Win). Compromise is a fallback. Force is for safety/legal emergencies only.",
      "boundary": "Resolve peer-to-peer disputes internally. Do not escalate technical team conflicts to the Project Sponsor."
    },
    "practice": {
      "mindset": "Collaborate before you escalate. View conflict as a resource for uncovering hidden risks.",
      "enablers": "Analyze Source & Stage // Determine Contextual Impact // Execute Resolution Technique.",
      "traps": "NEVER escalate internal team squabbles. AVOID 'Smoothing' as a permanent fix for recurring issues.",
      "artifacts": "Team Charter // Thomas-Kilmann Model // Conflict Log."
    }
  },
  "Lead a Team": {
    "learn": {
      "definition": "Leading is inspiring the team to achieve objectives through a shared vision and cultural alignment.",
      "context": "Leadership styles must pivot (Servant, Situational, Transformational) based on team maturity levels.",
      "path": "Adopt a Servant Leadership posture. Focus on removing blockers so the team can execute.",
      "boundary": "Leadership is about people and motivation; Management is about control and task tracking."
    },
    "practice": {
      "mindset": "Empowerment over micromanagement. Trust is the primary currency of a high-performing team.",
      "enablers": "Set Vision // Support Diversity & Inclusion // Inspire High Performance.",
      "traps": "Avoid 'Command and Control' distractors. Never bypass team members to talk to functional managers.",
      "artifacts": "Team Charter // RACI Matrix // Resource Management Plan."
    }
  },
  "Support Performance": {
    "learn": {
      "definition": "Evaluating member performance and providing feedback to optimize overall project outcomes.",
      "context": "Individual and team performance are measured against the Project Management Plan and Charter.",
      "path": "Provide timely, constructive feedback focused on growth rather than purely on past mistakes.",
      "boundary": "Handle individual issues privately; celebrate team wins publicly to maintain high morale."
    },
    "practice": {
      "mindset": "Performance is a continuous feedback loop, not a static end-of-quarter event.",
      "enablers": "Appraise Performance // Verify Competencies // Reward Achievement.",
      "traps": "Do not wait until the project end for feedback. Never ignore underperformance until it impacts the critical path.",
      "artifacts": "Performance Appraisals // Training Records // Recognition Plan."
    }
  },
  "Empower Team Members": {
    "learn": {
      "definition": "Granting teams the authority and resources to make decisions and take ownership of their work.",
      "context": "Vital for Agile/Hybrid environments where self-organizing teams are a requirement for speed.",
      "path": "Shift from 'Director' to 'Facilitator.' Delegating authority increases team speed and commitment.",
      "boundary": "Empowerment requires 'Guardrails' (limits of authority) clearly defined in the Team Charter."
    },
    "practice": {
      "mindset": "Ownership drives results. The team should be autonomous within their defined scope.",
      "enablers": "Delegate Authority // Support Self-Organization // Foster Individual Accountability.",
      "traps": "Do not 'hover' or take back authority the moment a minor mistake is made.",
      "artifacts": "Delegation Log // Skills Matrix // Agile Manifesto."
    }
  },
  "Ensure Training": {
    "learn": {
      "definition": "Identifying skill gaps and providing the necessary resources for team development.",
      "context": "Training needs evolve as the project lifecycle moves from planning to execution.",
      "path": "Budget for training early. Cross-training reduces the risk of 'Single Points of Failure'.",
      "boundary": "Distinguish between 'Training' (tactical skills) and 'Mentoring' (long-term career growth)."
    },
    "practice": {
      "mindset": "An upskilled team requires less supervision and produces higher quality output.",
      "enablers": "Determine Training Needs // Allocate Budget // Verify Efficacy of Learning.",
      "traps": "Don't assume all performance issues are training issues; check for tool or resource gaps first.",
      "artifacts": "Skills Gap Analysis // Resource Management Plan // Training Certificates."
    }
  },
  "Build Team": {
    "learn": {
      "definition": "Bringing the right individuals together and fostering a cohesive, productive group dynamic.",
      "context": "Success depends on understanding both technical chemistry and personality dynamics.",
      "path": "Proactively move the team through Tuckman’s stages from Forming to Performing.",
      "boundary": "Team building is an ongoing effort throughout the project, not a one-time social event."
    },
    "practice": {
      "mindset": "A unified team is your strongest defense against project complexity.",
      "enablers": "Appraise Team Skills // Hire/Acquire Resources // Build Team Culture.",
      "traps": "Avoid hiring 'brilliant jerks' who destroy team collaboration and morale.",
      "artifacts": "Staffing Estimates // RAM/RACI Chart // Virtual Team Tools."
    }
  }
}